"""Создайте новый класс с именем Thing2
и присвойте переменной letters значение 'abc'.
Выведите на экран значение letters."""


class Thing2:
    letters = 'abc'


print(Thing2.letters)
