"""Создайте класс Thing, не имеющий содержимого,
и выведите его на экран. Затем создайте объект example
этого класса и также выведите его. Совпадают ли выведенные значения?"""


class Thing:
    pass


print(Thing)

example = Thing()
print(example)
