"""Создайте список years_list, содержащий год, в который вы родились,
и каждый последующий год вплоть до вашего пятого дня рождения.
Например, если вы родились в 1980 году, список будет выглядеть так:
years_list = [1980, 1981, 1982, 1983, 1984, 1985].
Если вам меньше пяти лет, но вы уже читаете эту книгу,
то я даже не знаю, что сказать."""

years_list = [1992, 1993, 1994, 1995, 1996, 1997]
print(years_list)
