"""Напишите с большой буквы тот элемент списка things,
который означает человека, а затем выведите список.
Изменился ли элемент списка?"""

things = ['mozzarella', 'cinderella', 'salmonella']

things[1] = things[1].capitalize()

print(things)
