"""
Выведите на экран список всех файлов из родительского каталога.
"""
import os

print(os.listdir('..'))
