"""Создайте словарь с именем plain,
содержащий пары «ключ — значение» 'a': 1, 'b': 2 и 'c':3,
а затем выведите его на экран."""

plain = {'a': 1, 'b': 2, 'c': 3}

print(plain)
