"""Выведите на экран следующее стихотворение, используя старый стиль форматирования.
Подставьте в него такие строки: 'roast beef', 'ham', 'head' и 'clam':"""

print("My kitty cat likes %s, \n"
      "My kitty cat likes %s, \n"
      "My kitty cat fell on his %s \n"
      "And now thinks he's a %s." % ('roast beef', 'ham', 'head', 'clam'))
