"""Создайте англо-французский словарь с названием e2f и выведите его на экран.
Вот ваши первые слова: dog/chien, cat/chat и walrus/morse."""

e2f = {'dog': 'chien', 'cat': 'chat', 'walrus': 'morse'}

print(e2f)
