"""Выведите на экран множество английских слов из ключей словаря e2f."""

e2f = {'dog': 'chien', 'cat': 'chat', 'walrus': 'morse'}

print(set(e2f))
